{
    "version": "https://jsonfeed.org/version/1",
    "title": "David Gorski&#x27;s Tech Blog",
    "description": "",
    "home_page_url": "https://tech.davidgorski.ca",
    "feed_url": "https://tech.davidgorski.ca/feed.json",
    "user_comment": "",
    "author": {
        "name": "David Gorski"
    },
    "items": [
        {
            "id": "https://tech.davidgorski.ca/a-simple-personal-data-backup-setup.html",
            "url": "https://tech.davidgorski.ca/a-simple-personal-data-backup-setup.html",
            "title": "A Simple Personal Data Backup Setup",
            "content_html": "<div>\n<div>Until recently, my only computer was a 2013 MacBook Air. I backed it up using the included Time Machine system and an external spinning disk hard drive. With the nature of it being a laptop, I didn't have the external drive plugged in all the time, and so I set a calendar reminder to do a weekly backup because I knew I wouldn't do it daily. It's embarrassing to admit that even as a 'tech professional', there were plenty of weeks that I skipped backing up my content. I was used to the computer working all the time, I was busy and I always had some excuse to ignore the reminders. MacOS Notifications would beg me to do something:</div>\n<br>\n<div>```</div>\n<div>It has been 3 weeks since you backed up your computer! You're asking for data loss chump!</div>\n<div>```</div>\n<br>\n<div>It's pretty obvious that in order for it to function properly, you need an automatic backup system. Otherwise, human complacency and laziness take over. Your data needs to be backed up without any input from you. Having recently undertaken an initiative to upgrade and enhance my personal technology setup, I knew I could do better.</div>\n<br>\n<div>## My Overall Requirements</div>\n<div>1. Multiple copies of my data to survive hardware/software failure.</div>\n<div>2. Live data synchronization between my MacBook and new Linux Workstation.</div>\n<div>3. Snapshots available for restore.</div>\n<div>4. Remote copies of my data.</div>\n<br>\n<div>## The Guiding Principle - 3,2,1</div>\n<div>This is something that is obvious, but it really is the bare minimum, even for your personal data. The [3,2,1 rule](https://us-cert.cisa.gov/sites/default/files/publications/data_backup_options.pdf) states that you need:</div>\n<br>\n<div>- **3 backups**: 3 total copies of your data.</div>\n<div>- **2 local**: 2 locally available copies.</div>\n<div>- **1 remote**: 1 off-site copy.</div>\n<br>\n<div>If you satisfy these requirements, your chance of data loss is incredibly slim.</div>\n<br>\n<div>## Local First</div>\n<div>There are many fancy approaches to create local, automatic, backup systems. Fundamentally, they lean on having a dedicated device, on-prem, holding your data. These options included:</div>\n<br>\n<div>- Purpose-built Network Attached Storage with multiple storage bays</div>\n<div>- Raspberry Pi with added hardware</div>\n<div>- Full Data Server</div>\n<br>\n<div>For my needs, these were a little overkill. I wasn't planning on using my backup as a streaming source or personal media server. I just really needed my data to be synchronized between my Macbook and my Linux Workstation. Surely there must be a simple solution for this? Luckily for me, I found [Syncthing](https://syncthing.net/). I am very satisfied with the operational simplicity of this tool. I can just point the app to my data folder on each device, and it does the rest. The included ignore pattern functionality is also very useful in reducing the synchronization data volume amount. The nice effect of live synchronization is that the data changes are immediately reflected on the other machine.</div>\n<br>\n<div>However, even though live synchronization maintains two copies of my data it is **not** a replacement for true backups! What if the data became corrupted on one device? The daemon would sync this corruption to the other device and I would lose content! This is what **versioned backups** prevent by creating snapshots of your data at certain points in time. Because my use case is simple, I am delegating versioned backups to the remote backup element.</div>\n<br>\n<div>## Remote Backups</div>\n<div>With a live synchronization system working locally, I set out to add a remote backup portion to the setup. My personal stuff is not mission-critical. Maybe yours is, but mine isn't, so a remote backup frequency of once per day was enough. Anyways, I settled on the following requirements:</div>\n<br>\n<div>1. **Inexpensive**: I don't want to break the bank.</div>\n<div>2. **Encrypted**: I'm not a privacy nut, but something still feels wrong about giving someone else carte blanche access to my data.</div>\n<div>3. **Scheduled**: I would like this backup to run once a day.</div>\n<div>4. **Open-Source**: This is important for two reasons: I don't want to be locked-in and I want to be sure the app does what it says it does.</div>\n<br>\n<div>To make a long story short; I ended up using [anacron](https://en.wikipedia.org/wiki/Anacron) and [duplicity](http://duplicity.nongnu.org/) with [Backblaze B2](https://www.backblaze.com/b2/cloud-storage.html) on my Linux Workstation.</div>\n<br>\n<div>**Anacron** allows task scheduling for devices that are not always on. So if you schedule something to run once a day, as long as your computer is on for a portion of the day; it will run.</div>\n<br>\n<div>**Duplicity** is an amazing all-in-one encryption and upload command-line backup tool. It supports full and partial backups along with support for most cloud providers. I set it up to delete the partial incremental backups after 30 days and do a full backup to save space in the long run.</div>\n<br>\n<div>**Backblaze B2** is an solid, inexpensive online storage provider. It provided all the features I needed and is compatible with duplicity out of the box.</div>\n<br>\n<div>The following is templated copy of my backup script. Please note the **firefox profile backup** and the use of **systemd-inhibit** to prevent shutting down the computer while the backup is in progress:</div>\n<br>\n<div>```bash</div>\n<div># Sync firefox profile into data folder</div>\n<div>rsync -a {{FIRFOX_FOLDER}} {{DATA_FOLDER}}</div>\n<br>\n<div># Push latest changes to cloud</div>\n<div>systemd-inhibit --why=\"Daily Backup In-Progress\" duplicity \\</div>\n<div>--verbosity 8 \\</div>\n<div>{{DATA_FOLDER}}\\</div>\n<div>{{CLOUD_ENPOINT_AND_API_KEY}} \\</div>\n<div>--asynchronous-upload\\</div>\n<div>--full-if-older-than 1M \\</div>\n<div>--allow-source-mismatch\\</div>\n<div>&gt;&gt; {{LOG_FILE}}</div>\n<div> </div>\n<div>echo \"personal backup complete ($(date))\" &gt;&gt; {{LOG_FILE}}</div>\n<div>```</div>\n<br>\n<div>## Epilogue</div>\n<div>Since setting up this system, not a single part of has failed. And maybe, it never will. But I am no longer embarrassed of my backup system and I sleep a little better at night. Please take this as a reminder to back your important stuff up. Hopefully you'll never have to thank me!</div>\n</div>",
            "author": {
                "name": "David Gorski"
            },
            "tags": [
            ],
            "date_published": "2023-05-20T15:54:16-04:00",
            "date_modified": "2023-05-20T15:54:16-04:00"
        },
        {
            "id": "https://tech.davidgorski.ca/collector-functions-in-scheme.html",
            "url": "https://tech.davidgorski.ca/collector-functions-in-scheme.html",
            "title": "Collector Functions in Scheme",
            "content_html": "<p>The Collector paradigm is a functional way of assembling and processing collections of data. As a design pattern it also offers a few benefits, and at the very least provides a unique academic exercise.</p>\n<p>I’ve recently been working through the classic book; <a href=\"https://www.goodreads.com/book/show/548914.The_Little_Schemer\">The Little Schemer</a>, which is a cute and concise introduction to Scheme. The Chapter covering this topic delivered the first real friction, so I took some time to chew through it, understand it, and expand its explanation.</p>\n<p>Let’s start by defining a function which takes a list of numbers, and uses the collector paradigm to sort the numbers into two categories, Odd and Even:</p>\n<pre><code class=\"language-scheme\">(define sep-odds\n  (lambda (lat col)\n    (cond\n      ((null? lat)\n        (col &#39;() &#39;()))\n      ((= (modulo (car lat) 2) 0)\n        (sep-odds (cdr lat) (lambda (odds evens)\n                              (col odds (cons (car lat) evens)))))\n      (else\n        (sep-odds (cdr lat) (lambda (odds evens)\n                                (col (cons (car lat) odds) evens)))))))\n</code></pre>\n<p>This function will consume two arguments: a list of numbers (lat) and a collector function (col). Its body consist’s of one <strong>cond</strong> statement with 3 branches:</p>\n<table>\n<thead>\n<tr>\n<th>Branch</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>(null? lat)</td>\n<td>Checks if <strong>lat</strong> is empty</td>\n</tr>\n<tr>\n<td>(= (modulo (car lat) 2) 0)</td>\n<td>Checks if the first entry in the list is even</td>\n</tr>\n<tr>\n<td>else</td>\n<td>Concludes first list entry must be odd</td>\n</tr>\n</tbody></table>\n<p>Take a note as to how <strong>sep-odds</strong> recurs: It does not build a list in the simple way of functionally building up a collection. Instead, if <strong>sep-odds</strong> is to recur it builds a lambda function which will perform a particular task (in this case using <strong>cons</strong> to prepend the number to one of the lists) and then passes this lambda function to the next call of <strong>sep-odds</strong> as the <strong>col</strong> argument.</p>\n<p>Wrapping a task in a lambda is a neat trick: It delays execution of the wrapped code until the lambda is called.</p>\n<p>Another neat trick is that <strong>sep-odds</strong> stuffs the previous collector function (bound to <strong>col</strong> as a function parameter) into the new lambda’s body. I like to visualize this as a sandwich, with previous collectors being stuffed inside new ones. Finally, when one of these lambdas is called, it does its work, and then calls the collector function embedded inside it.</p>\n<p>For our <strong>sep-odds</strong> function, you may notice that we need to provide an initial collector. Let’s get to it.</p>\n<p><strong>First Time with Scheme?</strong> <em>Please Note: (car x) returns the first element of the list x, and (cdr x) returns list x excluding the first element.</em></p>\n<p>We will define <strong>list</strong> as our 0th collector. This will be the very centre of the lambda function sandwich:</p>\n<pre><code class=\"language-scheme\">(define col-0 list)\n</code></pre>\n<p>Now let’s step through what happens when we perform the following function call:</p>\n<pre><code class=\"language-scheme\">(sep-odds &#39;(1 2 3 4) col-0) ; return value -&gt; ((1 3) (2 4))\n</code></pre>\n<p><strong>(car lat)</strong> for the first call of sep-odds is <strong>1</strong>, therefore the third condition (<strong>else</strong>) is matched. This will generate a new lambda with <strong>col-0</strong> as <strong>col</strong> and <strong>1 (car lat)</strong> inside it. For clarity, we will label this newly generated lambda function as <strong>col-1</strong>:</p>\n<pre><code class=\"language-scheme\">; consumes two lists (odds and evens) and adds 1 to the odds list\n(define col-1\n  (lambda (odds evens)\n    (col-0 (cons 1 odds) evens)))\n</code></pre>\n<p>This conditional branch will then call sep-odds again, with the rest of the list <strong>(cdr lat)</strong> and the newly-generated <strong>col-1</strong> as arguments:</p>\n<pre><code class=\"language-scheme\">(sep-odds &#39;(2 3 4) col-1)\n</code></pre>\n<p>After this second function call the second conditional branch <strong>(= (modulo (car lat) 2) 0)</strong> is triggered as 2 is an even number. Same story again: a new lambda is built, but this time <strong>col-1</strong> is bound to <strong>col</strong>:</p>\n<pre><code class=\"language-scheme\">; consumes two lists (odds and evens) and adds 2 to the evens list\n(define col-2\n  (lambda (odds evens)\n    (col-1 odds (cons 2 evens))))\n</code></pre>\n<p>Now <strong>col-2</strong> and the remainder of the list will serve as the arguments for the <strong>sep-odds</strong> recursive call:</p>\n<pre><code class=\"language-scheme\">(sep-odds &#39;(3 4) col-2)\n</code></pre>\n<p>We repeat, again with an odd number (<strong>3</strong>):</p>\n<pre><code class=\"language-scheme\">; consumes two lists (odds and evens) and adds 3 to the odds list\n(define col-3\n  (lambda (odds evens)\n    (col-2 (cons 3 odds) evens)))\n</code></pre>\n<p>and our next call:</p>\n<pre><code class=\"language-scheme\">(sep-odds &#39;(4) col-3)\n</code></pre>\n<p>Again, with an even number (<strong>4</strong>):</p>\n<pre><code class=\"language-scheme\">; consumes two lists (odds and evens) and adds 4 to the evens list\n(define col-4\n  (lambda (odds evens)\n    (col-3 odds (cons 4 evens))))\n</code></pre>\n<p>Finally, since the input list is empty, the <strong>null?</strong> conditional is triggered with this final call:</p>\n<pre><code class=\"language-scheme\">(sep-odds &#39;() col-4)\n</code></pre>\n<p>That <strong>null?</strong> conditional applies the <strong>col</strong> function. In this case it is our latest, <strong>col-4</strong>:</p>\n<pre><code class=\"language-scheme\">; excerpt:\n((null? lat) (col-4 &#39;() &#39;()))\n</code></pre>\n<p>At this moment our sandwich is at its juiciest. Each layer takes an input from the previous one, as the layers are stripped away. We will begin with the outside ‘bun’ of the sandwich and go inwards. Each collector function calls the collector embedded within it:</p>\n<pre><code class=\"language-scheme\">(define col-4\n  (lambda (odds evens)\n    (col-3 odds (cons 4 evens))))\n;   |____|\n;     |\n;     |\n      (define col-3\n        (lambda (odds evens)\n          (col-2 (cons 3 odds) evens)))\n;         |____|\n;           |\n;           |\n            (define col-2\n              (lambda (odds evens)\n                (col-1 odds (cons 2 evens))))\n;               |____|\n;                 |\n;                 |\n                  (define col-1\n                    (lambda (odds evens)\n                      (col-0 (cons 1 odds) evens)))\n</code></pre>\n<p>We are lucky we used labels, In reality the lambda generated looks like this:</p>\n<pre><code class=\"language-scheme\">(lambda (odds evens)\n    ((lambda (odds evens)\n          ((lambda (odds evens)\n                ((lambda (odds evens)\n                      (col-0 (cons 1 odds) evens))\n                  odds (cons 2 evens)))\n            (cons 3 odds) evens))\n      odds (cons 4 evens)))\n</code></pre>\n<p>And this is how the function calls look with the computed values of the arguments:</p>\n<pre><code class=\"language-scheme\">1. (col-4 &#39;() &#39;())\n2. (col-3 &#39;() &#39;(4))\n3. (col-2 &#39;(3) &#39;(4))\n4. (col-1 &#39;(3) &#39;(2 4))\n5. (col-0 &#39;(1 3) &#39;(2 4))\n6. (list &#39;(1 3) &#39;(2 4))\n7. ((1 3) (2 4))\n</code></pre>\n<p>All of these expressions have the same value.</p>\n<p>So now the big question: Why? Why complicate things like this? Why not just use multiple lists as arguments to gather the data we want?</p>\n<p>Well, Collector functions offer two advantages: Delayed Execution, and Continuations.</p>\n<p>To address the first point, in this example, each generated lambda is doing something relatively inexpensive: using <strong>cons</strong> to prepend a number to a list. But what if it was performing some sort of expensive operation? For example: performing operations on a matrix with massive proportions, or rendering graphics. Perhaps there is hypothetical example where we do not want to do anything computationally expensive until the data input has been completely verified, from start to finish? In that case a collector paradigm would work well. Building the collector works sort of as a type of manifest or queue, of operations to be performed.</p>\n<p>Secondly, if you have a function which represents a series of steps, and each step has their own state, you can travel back to these states. In effect, you save a snapshot of that point in time. And in Scheme, since you can pass function along; you can pass these snapshots around. This gives you flexibility to return back to times where data was valid or matched some sort of pattern. One thing that comes to mind is traversing a Tree data structure and if you are exploring the children of a branch, you can pass forward a collector that represents that root, until you reach something you need and feed that data into the collector.</p>\n",
            "author": {
                "name": "David Gorski"
            },
            "tags": [
                   "Technology"
            ],
            "date_published": "2023-03-05T21:39:51-05:00",
            "date_modified": "2023-05-20T16:18:36-04:00"
        }
    ]
}
